{
  "name": "Food Collection",
  "foodCategories": [
    "Bakery",
    "Dairy",
    "Fruits",
    "Grains",
    "Meat",
    "Seafood",
    "Vegetables",
    "Beverages",
    "Candy",
    "Condiments",
    "Herbs and Spices",
    "Nuts and Seeds",
    "Oils and Fats",
    "Snacks"
  ],
  "nutritionNames": [
    { "name": "calories", "healthyAmountRDA": 2000 },
    { "name": "protein", "healthyAmountRDA": 50 },
    { "name": "carbs", "healthyAmountRDA": 130 },
    { "name": "fat", "healthyAmountRDA": 60 },
    { "name": "fiber", "healthyAmountRDA": 25 },
    { "name": "sugar", "healthyAmountRDA": 25 }
  ],
  "foodList": [
    {
      "id": 1,
      "name": "Carrot",
      "Category": "vegetable",
      "calorie": "41 kcal",
      "carbhodyrate": "9.6 g",
      "protein": "0.9 g",
      "safetyScore": "95",
      "image": "https://images.unsplash.com/photo-1587574199251-27b9dd68b1c9",
      "advantages": "Carrots are rich in beta-carotene, which is converted to vitamin A in the body. This vitamin is essential for good vision, immune function, and skin health. Carrots also contain antioxidants and fiber, which can help reduce the risk of certain diseases."
    },
    {
      "id": 2,
      "name": "Cabbage",
      "Category": "vegetables",
      "calorie": "25 kcal",
      "carbhodyrate": "5.8 g",
      "protein": "1.3 g",
      "safetyScore": "93",
      "image": "https://images.unsplash.com/photo-1605308850728-87471d01a0ea",
      "advantages": "Cabbage is a low-calorie vegetable that is rich in vitamin C, fiber, and other nutrients. It also contains antioxidants that can help reduce inflammation and protect against certain types of cancer."
    },
    {
      "id": 3,
      "name": "Lamb",
      "Category": "meat",
      "calorie": "250 kcal",
      "carbhodyrate": "0 g",
      "protein": "25 g",
      "safetyScore": "80",
      "image": "https://images.unsplash.com/photo-1540189549336-2af46ab97e1c",
      "advantages": "Lamb is a good source of high-quality protein and is rich in vitamin B12, which is important for brain function and the production of red blood cells. It also contains iron and zinc, which are essential minerals for overall health."
    },
    {
      "id": 4,
      "name": "Pumpkin",
      "Category": "vegetables",
      "calorie": "26 kcal",
      "carbhodyrate": "6.5 g",
      "protein": "1 g",
      "safetyScore": "91",
      "image": "https://images.unsplash.com/photo-1602728865094-4f9f4d67df5a",
      "advantages": "Pumpkin is low in calories and high in fiber, making it a great food for weight loss and digestive health. It is also a good source of vitamin A and potassium, which can help support heart health and immune function."
    },
    {
      "id": 5,
      "name": "Milk",
      "Category": "Dairy",
      "calorie": "103 kcal",
      "carbhodyrate": "12.1 g",
      "protein": "8 g",
      "safetyScore": "94",
      "image": "https://images.unsplash.com/photo-1566553973051-1c1a7ff317c0",
      "advantages": "Milk is a good source of calcium, which is essential for strong bones and teeth. It also contains vitamin D, which helps the body absorb calcium. Milk is also a good source of high-quality protein and other important nutrients like potassium and vitamin B12."
    },
    {
      "id": 6,
      "name": "Apple",
      "Category": "Fruit",
      "calorie": "52",
      "carbhodyrate": "14g",
      "protein": "0.3g",
      "safetyScore": "A",
      "image": "https://images.unsplash.com/photo-1544627718-aeb9ac54f7ea",
      "advantages": "Apples are rich in antioxidants, fiber, and vitamin C. They are also low in calories and can help improve heart health by reducing cholesterol levels and lowering blood pressure. Eating apples can also aid in digestion and promote healthy weight management."
    },
    {
      "id": 7,
      "name": "Wallnut",
      "Category": "Nuts and Seeds",
      "calorie": "654",
      "carbhodyrate": "13.7g",
      "protein": "15.2g",
      "safetyScore": "A",
      "image": "https://images.unsplash.com/photo-1575389819312-07d6d0f67c37",
      "advantages": "Walnuts are a good source of healthy fats, protein, and fiber. They also contain antioxidants and other nutrients that can help reduce inflammation, lower cholesterol levels, and improve heart health."
    },
    {
      "id": 8,
      "name": "Eggs",
      "Category": "Meat",
      "calorie": "78",
      "carbhodyrate": "0.6g",
      "protein": "6g",
      "safetyScore": "A",
      "image": "https://images.unsplash.com/photo-1614768346929-22858e14d6fd",
      "advantages": "Eggs are a great source of high-quality protein, vitamins, and minerals. They also contain healthy fats, antioxidants, and choline, which can benefit brain and heart health. Studies have shown that regular consumption of eggs can help maintain healthy cholesterol levels and reduce the risk of some chronic diseases, such as heart disease and diabetes."
    },
    {
      "id": 9,
      "name": "Salmon",
      "Category": "Fish",
      "calorie": "206",
      "carbhodyrate": "0g",
      "protein": "22g",
      "safetyScore": "A",
      "image": "https://images.unsplash.com/photo-1521747116042-5a810fda9664",
      "advantages": "Salmon is a great source of protein and omega-3 fatty acids, which can help reduce inflammation, improve heart health, and support brain function. It also contains vitamin D, which is essential for bone health and immune function."
    },
    {
      "id": 10,
      "name": "Blueberries",
      "Category": "Fruit",
      "calorie": "57",
      "carbhodyrate": "14g",
      "protein": "0.7g",
      "safetyScore": "A",
      "image": "https://images.unsplash.com/photo-1519681393784-d120267933ba",
      "advantages": "Blueberries are rich in antioxidants and other nutrients that can help reduce inflammation, improve heart health, and support brain function. They are also low in calories and can help promote healthy digestion and weight management."
    },
    {
      "id": 11,
      "name": "Quinoa",
      "Category": "Grain",
      "calorie": "120",
      "carbhodyrate": "21g",
      "protein": "4g",
      "safetyScore": "A",
      "image": "https://images.unsplash.com/photo-1598511382307-9fae9f32e985",
      "advantages": "Quinoa is a gluten-free grain that is rich in protein, fiber, and other important nutrients. It can help regulate blood sugar levels, reduce inflammation, and promote healthy digestion. Quinoa is also a good source of iron and magnesium, which are essential minerals for overall health."
    },
    {
      "id": 12,
      "name": "Spinach",
      "Category": "Vegetable",
      "calorie": "23",
      "carbhodyrate": "3.6g",
      "protein": "2.9g",
      "safetyScore": "A",
      "image": "https://images.unsplash.com/photo-1581090456976-43a21de0b6f8",
      "advantages": "Spinach is a low-calorie vegetable that is rich in vitamins, minerals, and antioxidants. It can help improve eye health, reduce the risk of cancer and other chronic diseases, and support bone health. Spinach is also a good source of iron, which is essential for healthy blood cells."
    },
    {
      "id": 13,
      "name": "Avocado",
      "Category": "Fruit",
      "calorie": "160",
      "carbhodyrate": "9g",
      "protein": "2g",
      "safetyScore": "A",
      "image": "https://images.unsplash.com/photo-1560265628-6a0f7517fa70",
      "advantages": "Avocado is a nutrient-dense fruit that is rich in healthy fats, fiber, and other important nutrients. It can help improve heart health, reduce inflammation, and support healthy digestion. Avocado is also a good source of vitamin E, which is important for skin and immune health."
    },
    {
      "id": 14,
      "name": "Broccoli",
      "Category": "Vegetable",
      "calorie": "31",
      "carbhodyrate": "6g",
      "protein": "3g",
      "safetyScore": "A",
      "image": "https://images.unsplash.com/photo-1519681393784-d120267933ba",
      "advantages": "Broccoli is a cruciferous vegetable that is rich in vitamins, minerals, and antioxidants. It can help reduce inflammation, improve heart health, and support healthy digestion. Broccoli is also a good source of fiber and protein, which can help promote satiety and weight management."
    },
    {
      "id": 15,
      "name": "Almonds",
      "Category": "Nuts and Seeds",
      "calorie": "161",
      "carbhodyrate": "6g",
      "protein": "6g",
      "safetyScore": "A",
      "image": "https://images.unsplash.com/photo-1521390094872-c4b3b66cb5f5",
      "advantages": "Almonds are a good source of healthy fats, protein, and fiber. They also contain antioxidants and other nutrients that can help reduce inflammation, lower cholesterol levels, and improve heart health. Almonds are also a good source of vitamin E, which is important for skin and immune health."
    },
    {
      "id": 16,
      "name": "Sweet Potato",
      "Category": "Vegetable",
      "calorie": "86",
      "carbhodyrate": "20g",
      "protein": "2g",
      "safetyScore": "A",
      "image": "https://images.unsplash.com/photo-1541692915173-4f2703e99297",
      "advantages": "Sweet potatoes are a good source of complex carbohydrates, fiber, and vitamins. They can help regulate blood sugar levels, reduce inflammation, and support healthy digestion. Sweet potatoes are also rich in antioxidants like beta-carotene, which can help improve immune function and reduce the risk of chronic diseases."
    },
    {
      "id": 17,
      "name": "Oats",
      "Category": "Grain",
      "calorie": "147",
      "carbhodyrate": "27g",
      "protein": "5g",
      "safetyScore": "A",
      "image": "https://images.unsplash.com/photo-1610367031933-c32c2cf1231a",
      "advantages": "Oats are a good source of fiber, protein, and other important nutrients. They can help lower cholesterol levels, reduce inflammation, and improve blood sugar control. Oats are also rich in antioxidants, which can help protect against chronic diseases."
    },
    {
      "id": 18,
      "name": "Chicken Breast",
      "Category": "Meat",
      "calorie": "165",
      "carbhodyrate": "0g",
      "protein": "31g",
      "safetyScore": "A",
      "image": "https://images.unsplash.com/photo-1603727216934-c9ef51cd7b0d",
      "advantages": "Chicken breast is a good source of high-quality protein and essential amino acids. It can help support muscle growth and repair, improve bone health, and promote healthy weight management. Chicken breast is also low in calories and fat, making it a healthy choice for those trying to lose weight."
    },
    {
      "id": 19,
      "name": "Kale",
      "Category": "Vegetable",
      "calorie": "33",
      "carbhodyrate": "6g",
      "protein": "3g",
      "safetyScore": "A",
      "image": "https://images.unsplash.com/photo-1532187863487-5a810fda9664",
      "advantages": "Kale is a nutrient-dense leafy green that is rich in vitamins, minerals, and antioxidants. It can help improve eye health, reduce inflammation, and support healthy digestion. Kale is also a good source of fiber and protein, which can help promote satiety and weight management."
    },
    {
      "id": 20,
      "name": "Black Beans",
      "Category": "Legumes",
      "calorie": "227",
      "carbhodyrate": "40g",
      "protein": "15g",
      "safetyScore": "A",
      "image": "https://images.unsplash.com/photo-1513161455610-fbb130471ebb",
      "advantages": "Black beans are a good source of complex carbohydrates, fiber, and protein. They can help regulate blood sugar levels, reduce inflammation, and support healthy digestion. Black beans are also rich in antioxidants, which can help protect against chronic diseases like cancer and heart disease."
    }
  ]
}
